{
  "features": [
    {
      "icon": "🎯",
      "title": "500+ Exciting Levels",
      "description": "Challenge yourself with hundreds of unique puzzle levels that get progressively more challenging. Each level brings new challenges and exciting gameplay mechanics."
    },
    {
      "icon": "🦁",
      "title": "Wild Animal Collection",
      "description": "Discover and match beautiful safari animals with unique abilities and special powers. From majestic lions to graceful giraffes, each animal has its own personality."
    },
    {
      "icon": "⚡",
      "title": "Powerful Boosters",
      "description": "Unlock and use amazing boosters to clear difficult levels and achieve higher scores. Strategic use of boosters can turn impossible levels into exciting victories."
    },
    {
      "icon": "🌿",
      "title": "Stunning Safari Graphics",
      "description": "Immerse yourself in beautiful safari landscapes with vibrant colors and smooth animations. Every visual element is crafted to enhance your gaming experience."
    },
    {
      "icon": "🏆",
      "title": "Achievement System",
      "description": "Track your progress with a comprehensive achievement system. Unlock special rewards and showcase your puzzle-solving skills to friends and family."
    },
    {
      "icon": "🎮",
      "title": "Multiple Game Modes",
      "description": "Enjoy various game modes including Classic, Time Attack, and Puzzle Challenge. Each mode offers a unique twist on the classic match-3 gameplay."
    }
  ],
  "instructions": [
    {
      "title": "Match Three or More",
      "description": "Connect three or more identical animal blocks in a row or column to make them disappear. The more blocks you match, the higher your score!"
    },
    {
      "title": "Create Special Combinations",
      "description": "Match four or more blocks to create powerful special blocks that can clear entire rows or columns. These special blocks are key to solving difficult levels."
    },
    {
      "title": "Use Boosters Wisely",
      "description": "Collect boosters and use them strategically to overcome challenging levels and obstacles. Save powerful boosters for the most difficult situations."
    },
    {
      "title": "Plan Your Moves",
      "description": "Think ahead and plan your moves carefully. Sometimes the best move isn't the most obvious one. Look for opportunities to create cascading combinations."
    },
    {
      "title": "Master the Grid",
      "description": "Learn how blocks fall and plan your strategy accordingly. Understanding the grid mechanics will help you create amazing combinations and achieve higher scores."
    }
  ],
  "testimonials": [
    {
      "name": "Sarah M.",
      "comment": "This game is absolutely addictive! The safari theme is so much fun and the puzzles are challenging but fair. I've been playing for months and still discovering new strategies."
    },
    {
      "name": "Mike R.",
      "comment": "Love the animal characters and the boosters make the game really exciting. Perfect for puzzle lovers! The graphics are beautiful and the gameplay is smooth."
    },
    {
      "name": "Emma L.",
      "comment": "Great graphics and smooth gameplay. The level progression keeps me coming back for more! I love how each level feels unique and challenging."
    },
    {
      "name": "David K.",
      "comment": "The safari theme is brilliant! I love matching the different animals and the boosters add a great strategic element. Highly recommend for anyone who loves puzzle games."
    },
    {
      "name": "Lisa P.",
      "comment": "Perfect game to relax with after a long day. The beautiful graphics and satisfying match sounds make it very therapeutic. Can't stop playing!"
    }
  ],
  "animals": [
    {
      "name": "Lion",
      "emoji": "🦁",
      "description": "The king of the jungle with powerful matching abilities. Lion blocks are strong and can create powerful combinations when matched in groups.",
      "power": 3
    },
    {
      "name": "Elephant",
      "emoji": "🐘",
      "description": "Mighty and wise, elephant blocks have the highest power level. They're rare but incredibly valuable for clearing difficult obstacles.",
      "power": 5
    },
    {
      "name": "Giraffe",
      "emoji": "🦒",
      "description": "Tall and graceful, giraffe blocks can reach across the grid to create unique matching opportunities and special combinations.",
      "power": 2
    },
    {
      "name": "Zebra",
      "emoji": "🦓",
      "description": "Fast and agile, zebra blocks are common but essential. They're perfect for creating quick matches and building up your score.",
      "power": 1
    },
    {
      "name": "Hippo",
      "emoji": "🦛",
      "description": "Strong and steady, hippo blocks are excellent for clearing obstacles and creating powerful chain reactions across the grid.",
      "power": 4
    }
  ],
  "boosters": [
    {
      "name": "Lightning Strike",
      "icon": "⚡",
      "description": "A powerful booster that clears an entire row or column instantly. Perfect for removing stubborn obstacles and creating space for new combinations.",
      "effect": "Row/Column Clear"
    },
    {
      "name": "Jungle Blast",
      "icon": "💥",
      "description": "Creates a massive explosion that clears all blocks within a 3x3 area. Great for clearing clustered obstacles and creating opportunities.",
      "effect": "Area Clear"
    },
    {
      "name": "Safari Swap",
      "icon": "🔄",
      "description": "Allows you to swap any two blocks on the grid, regardless of their position. Use strategically to create perfect combinations.",
      "effect": "Block Swap"
    },
    {
      "name": "Wild Combo",
      "icon": "🎯",
      "description": "Automatically finds and matches the best possible combination on the grid. Perfect for when you're stuck or need a quick boost.",
      "effect": "Auto Match"
    }
  ],
  "levels": [
    {
      "number": 1,
      "name": "Welcome to Safari",
      "completed": true,
      "description": "Your first adventure begins! Learn the basics of matching animal blocks in this gentle introduction to the safari world."
    },
    {
      "number": 2,
      "name": "First Steps",
      "completed": true,
      "description": "Practice your matching skills with slightly more challenging puzzles. Discover the joy of creating special combinations."
    },
    {
      "number": 3,
      "name": "Animal Friends",
      "completed": false,
      "description": "Meet more safari animals and learn about their unique abilities. This level introduces new mechanics and challenges."
    },
    {
      "number": 4,
      "name": "Jungle Challenge",
      "completed": false,
      "description": "The jungle gets tougher! Face new obstacles and learn to use boosters effectively to overcome challenges."
    },
    {
      "number": 5,
      "name": "Savanna Master",
      "completed": false,
      "description": "Prove your skills in this challenging level that combines all the mechanics you've learned so far."
    }
  ]
}
